hewittmcg/mte380/stm32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "l298n_motor_controller.h"
#include "vl53l0x_api.h"
#include <stdio.h>
#include "stm32f4xx_hal_gpio.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define MOTOR_RATIO_MIN 1.0f
#define MOTOR_RATIO_MAX 3.0f
#define TOF_CALIBRATION_DIST 43000
#define STOPPING_DISTANCE 250

// Motor speeds
#define BASE_MOTOR_SPEED 50
#define TURNING_MOTOR_SPEED 100

// Scaling factor to compensate for right motor being weaker.
#define RMOTOR_SCALING_FACTOR 2

// Motors used in murphy.
typedef enum {
	FRONT_LEFT_MOTOR = 0,
	FRONT_RIGHT_MOTOR,
	REAR_LEFT_MOTOR,
	REAR_RIGHT_MOTOR,
	NUM_MOTORS,
} Motor;

// ToF sensor locations.
typedef enum {
  FORWARD_TOF = 0,
  FRONT_SIDE_TOF,
  REAR_SIDE_TOF,
  NUM_TOFS,
} TofSensor;

struct TOF_Calibration{
  uint32_t refSpadCount;
  uint8_t isApertureSpads;
  uint8_t VhvSettings;
  uint8_t PhaseCal;
  VL53L0X_RangingMeasurementData_t RangingData;
};

// Status of ToF sensors.
typedef struct {
	volatile int data_ready[NUM_TOFS]; // Set by ISR handling EXTI from ToF sensor
} TofStatus;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
#define MIN(a,b) (((a)<(b))?(a):(b))
#define MAX(a,b) (((a)>(b))?(a):(b))
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
FMPI2C_HandleTypeDef hfmpi2c1;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;
I2C_HandleTypeDef hi2c3;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim8;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */

// TODO: move this somewhere better
#ifdef __GNUC__
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif

PUTCHAR_PROTOTYPE
{
  HAL_UART_Transmit(&huart2, (uint8_t *)&ch, 1, HAL_MAX_DELAY);
  return ch;
}

// ToF sensor comms
VL53L0X_Dev_t  vl53l0x_1; // front left
VL53L0X_DEV    FL_I2C1 = &vl53l0x_1;
VL53L0X_Dev_t  vl53l0x_2; // rear left
VL53L0X_DEV    RL_I2C2 = &vl53l0x_2;
VL53L0X_Dev_t  vl53l0x_3; // rear right
VL53L0X_DEV    FR_I2C3 = &vl53l0x_3;

// Motor controller pin mappings
static MotorController controllers[NUM_MOTORS] = {
		[FRONT_LEFT_MOTOR] = {
			.in1_pin = {GPIO_PIN_14, GPIOB},
			.in2_pin = {GPIO_PIN_15, GPIOB},
			.en_pin = {&htim1, TIM_CHANNEL_2, &TIM1->CCR2},
		},
		[FRONT_RIGHT_MOTOR] = {
			.in1_pin = {GPIO_PIN_11, GPIOC},
			.in2_pin = {GPIO_PIN_10, GPIOC},
			.en_pin = {&htim1, TIM_CHANNEL_3, &TIM1->CCR3},
		},
		[REAR_LEFT_MOTOR] = {
			.in1_pin = {GPIO_PIN_15, GPIOA},
			.in2_pin = {GPIO_PIN_1, GPIOA},
			.en_pin = {&htim1, TIM_CHANNEL_4, &TIM1->CCR4},
		},
		[REAR_RIGHT_MOTOR] = {
			.in1_pin = {GPIO_PIN_4, GPIOB},
			.in2_pin = {GPIO_PIN_5, GPIOB},
			.en_pin = {&htim8, TIM_CHANNEL_3, &TIM8->CCR3},
		},
};

// ToF sensor device mappings
static const VL53L0X_DEV *GET_TOF_DEV_PTR[NUM_TOFS] = {
  [FORWARD_TOF] = &FR_I2C3,
  [FRONT_SIDE_TOF] = &FL_I2C1,
  [REAR_SIDE_TOF] = &RL_I2C2,
};

// Storage for status of whether ToF sensor data ready
static TofStatus tof_status;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_FMPI2C1_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void MX_I2C3_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM8_Init(void);
/* USER CODE BEGIN PFP */

// TODO: move this somewhere else, just here for the time being
// Handle external interrupt from ToF sensors
void HAL_GPIO_EXTI_Callback(uint16_t gpio_pin) {
	switch(gpio_pin) {
	case FR_TOF_EXTI_Pin:
		tof_status.data_ready[FORWARD_TOF] = 1;
	case FL_TOF_EXTI_Pin:
		tof_status.data_ready[FRONT_SIDE_TOF] = 1;
	case RL_TOF_EXTI_Pin:
		tof_status.data_ready[REAR_SIDE_TOF] = 1;
	}
}
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void TOF_Init(VL53L0X_DEV dev, struct TOF_Calibration tof){
	// VL53L0X init for Single Measurement
	VL53L0X_WaitDeviceBooted(dev);
	VL53L0X_DataInit(dev);
	VL53L0X_StaticInit(dev);
	VL53L0X_PerformRefCalibration(dev, &tof.VhvSettings, &tof.PhaseCal);
	VL53L0X_PerformRefSpadManagement(dev, &tof.refSpadCount, &tof.isApertureSpads);
  VL53L0X_SetOffsetCalibrationDataMicroMeter(dev, TOF_CALIBRATION_DIST);
  VL53L0X_SetDeviceMode(dev, VL53L0X_DEVICEMODE_CONTINUOUS_RANGING);

	// Enable/Disable Sigma and Signal check
	VL53L0X_SetLimitCheckEnable(dev, VL53L0X_CHECKENABLE_SIGMA_FINAL_RANGE, 1);
	VL53L0X_SetLimitCheckEnable(dev, VL53L0X_CHECKENABLE_SIGNAL_RATE_FINAL_RANGE, 1);
	VL53L0X_SetLimitCheckValue(dev, VL53L0X_CHECKENABLE_SIGNAL_RATE_FINAL_RANGE, (FixPoint1616_t)(0.1*65536));
	VL53L0X_SetLimitCheckValue(dev, VL53L0X_CHECKENABLE_SIGMA_FINAL_RANGE, (FixPoint1616_t)(60*65536));
	VL53L0X_SetMeasurementTimingBudgetMicroSeconds(dev, 33000);
	VL53L0X_SetVcselPulsePeriod(dev, VL53L0X_VCSEL_PERIOD_PRE_RANGE, 18);
	VL53L0X_SetVcselPulsePeriod(dev, VL53L0X_VCSEL_PERIOD_FINAL_RANGE, 14);

	// Set up GPIO for interrupts
	VL53L0X_SetGpioConfig(dev, 0, VL53L0X_DEVICEMODE_CONTINUOUS_RANGING,
	        VL53L0X_REG_SYSTEM_INTERRUPT_GPIO_NEW_SAMPLE_READY,
	        VL53L0X_INTERRUPTPOLARITY_LOW);
	VL53L0X_StartMeasurement(dev);
	VL53L0X_ClearInterruptMask(dev, VL53L0X_REG_SYSTEM_INTERRUPT_GPIO_NEW_SAMPLE_READY);
}

